Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བ་ལགས་སམ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: V: 60} “Blessed Lord, is the perfection of wisdom not bereft of the perfection of wisdom?

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བ་ལགས་སམ།
en: Are the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity not bereft of the perfection of generosity [and so forth]?

source: ནང་སྟོང་པ་ཉིད་ནང་སྟོང་པ་ཉིད་དང་མ་བྲལ་བ་ལགས་སམ།
en: Is the emptiness of internal phenomena not bereft of the emptiness of internal phenomena?

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་མ་བྲལ་བ་ལགས་སམ།
en: Are [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, not bereft of the emptiness of the essential nature of nonentities [and so forth]?

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་མ་བྲལ་བ་ལགས་སམ། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་།
en: Are the applications of mindfulness not bereft of the applications of mindfulness?

source: དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་མ་བྲལ་བ་ལགས་སམ། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Are the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path not bereft of the noble eightfold path [and so forth]?

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་མ་བྲལ་བ་ལགས་སམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་།
en: Are the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways not bereft of the dhāraṇī gateways [and so forth]?

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་མ་བྲལ་བ་ལགས་སམ།
en: Are the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas not bereft of the eighteen distinct qualities of the buddhas [and so forth]?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བ་ལགས་སམ། དེ་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Are [the goals], up to and including all-aspect omniscience, not bereft of all-aspect omniscience [and so forth]? “

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བ་ཞིག་ལགས་ན་ནི། འོ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཇི་ལྟར་མངོན་པར་བསྒྲུབ་པར་བགྱི། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: If indeed it were the case that the perfection of wisdom is not bereft of the perfection of wisdom; that the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are not bereft of the perfection of generosity [and so forth]; and that [all the attributes and goals], up to and including all-aspect omniscience, are not bereft of all-aspect omniscience [and so forth], how then would the perfection of wisdom be brought into being?

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་། ཇི་ལྟར་མངོན་པར་བསྒྲུབ་པར་བགྱི།
en: How would the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity be brought into being?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡང་ཇི་ལྟར་མངོན་པར་བསྒྲུབ་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: How would [all the attributes and goals], up to and including all-aspect omniscience, be brought into being?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་ཤེ་འམ། འདི་ནི་གཟུགས་སོ། །འདིའི་གཟུགས་སོ་ཞེས་བྱ་བར་མངོན་པར་ཆགས་པ་མེད་དོ། །ཚོར་བ་དང་།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they are not fixated on the notions of ‘physical forms,’ ‘these physical forms,’ or ‘their physical forms.’

source: འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞེ་འམ། འདི་ནི་རྣམ་པར་ཤེས་པའོ། །འདིའི་རྣམ་པར་ཤེས་པའོ་ཞེས་བྱ་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions of ‘feelings,’ ‘perceptions,’ ‘formative predispositions,’ or ‘consciousness’; ‘this consciousness’ [and so forth]; or ‘their consciousness’ [and so forth].

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེ་འམ། འདི་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ། །འདིའི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ་ཞེས་བྱ་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions of ‘the sense fields,’ ‘the sensory elements,’ or ‘the links of dependent origination’; ‘these links of dependent origination’ [and so forth]; or ‘their links of dependent origination’ [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཞེ་འམ། འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ། །འདིའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ་ཞེས་བྱ་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions of ‘[the goals], up to and including all-aspect omniscience’; ‘this all-aspect omniscience’ [and so forth]; or ‘their all-aspect omniscience’ [and so forth]. “

source: །གཟུགས་རྟག་པ་འམ། མི་རྟག་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that physical forms are permanent, or that they are impermanent.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྟག་པ་འམ་མི་རྟག་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that feelings, perceptions, formative predispositions, and consciousness are permanent or impermanent.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྟག་པ་འམ་མི་རྟག་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that the sense fields, sensory elements, and links of dependent origination are permanent or impermanent.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྟག་པ་འམ་མི་རྟག་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that [the goals], up to and including all-aspect omniscience, are permanent or impermanent. “

source: །གཟུགས་བདེ་བ་འམ། སྡུག་བསྔལ་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that physical forms are imbued with happiness or suffering.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བདེ་བ་འམ་སྡུག་བསྔལ་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that feelings, perceptions, formative predispositions, and consciousness are imbued with happiness or suffering.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བདེ་བ་འམ་སྡུག་བསྔལ་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that the sense fields, sensory elements, and links of dependent origination are imbued with happiness or suffering.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བདེ་བ་འམ། སྡུག་བསྔལ་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that [the goals], up to and including all-aspect omniscience, are imbued with happiness or suffering. “

source: །གཟུགས་བདག་གམ། བདག་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that physical forms are with self or without self.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བདག་གམ། བདག་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that feelings, perceptions, formative predispositions, and consciousness are with self or without self.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བདག་གམ། བདག་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that the sense fields, sensory elements, and links of dependent origination are with self or without self.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བདག་གམ། བདག་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that [the goals], up to and including all-aspect omniscience, are with self or without self. “

source: །གཟུགས་ཞི་བ་འམ་མ་ཞི་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that physical forms are at peace or not at peace.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞི་བ་འམ་མ་ཞི་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that feelings, perceptions, formative predispositions, and consciousness are at peace or not at peace.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞི་བ་འམ་མ་ཞི་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that the sense fields, sensory elements, and links of dependent origination are at peace or not at peace.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཞི་བ་འམ། མ་ཞི་བར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that [the goals], up to and including all-aspect omniscience, are at peace or not at peace. “

source: །གཟུགས་སྟོང་པ་འམ། མི་སྟོང་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that physical forms are empty or not empty.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་འམ་མི་སྟོང་པར་མངོན་པར་ཆགས་པ་མེད་དོ། །སྐྱེ་མཆེད་དང་།
en: They are not fixated on the notions that feelings, perceptions, formative predispositions, and consciousness are empty or not empty.

source: ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟོང་པ་འམ་མི་སྟོང་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that the sense fields, sensory elements, and links of dependent origination are empty or not empty.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་པ་འམ་མི་སྟོང་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that [the goals], up to and including all-aspect omniscience, are empty or not empty. “

source: །གཟུགས་མཚན་མ་ཡོད་པ་འམ། མཚན་མ་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that physical forms are with signs or without signs.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་ཡོད་པ་འམ་མཚན་མ་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that feelings, perceptions, formative predispositions, and consciousness are with signs or without signs.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མཚན་མ་ཡོད་པ་འམ་མཚན་མ་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that the sense fields, sensory elements, and links of dependent origination are with signs or without signs.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མཚན་མ་ཡོད་པ་འམ་མཚན་མ་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that [the goals], up to and including all-aspect omniscience, are with signs or without signs. “

source: །གཟུགས་སྨོན་པ་ཡོད་པ་འམ་སྨོན་པ་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that physical forms have aspirations or lack aspirations.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་ཡོད་པ་འམ། སྨོན་པ་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that feelings, perceptions, formative predispositions, and consciousness have aspirations or lack aspirations.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྨོན་པ་ཡོད་པ་འམ་སྨོན་པ་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that the sense fields, sensory elements, and links of dependent origination have aspirations or lack aspirations.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྨོན་པ་ཡོད་པ་འམ། སྨོན་པ་མེད་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that [the goals], up to and including all-aspect omniscience, have aspirations or lack aspirations. “

source: །གཟུགས་དབེན་པ་འམ་མི་དབེན་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They are not fixated on the notions that physical forms are void or not void.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དབེན་པ་འམ་མི་དབེན་པར་མངོན་པར་ཆགས་པ་མེད་དོ། །སྐྱེ་མཆེད་དང་།
en: They are not fixated on the notions that feelings, perceptions, formative predispositions, and consciousness are void or not void. {

source: ཁམས་དང་།
en: Ki.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དབེན་པ་འམ་མི་དབེན་པར་མངོན་པར་ཆགས་པ་མེད་དོ།
en: V: 61} They are not fixated on the notions that the sense fields, sensory elements, and links of dependent origination are void or not void.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དབེན་པ་འམ་མི་དབེན་པར་མངོན་པར་ཆགས་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རང་བཞིན་མེད་པའི་ཆོས་ནི་རྟག་ཅེས་བྱ་བ་འམ། མི་རྟག་ཅེས་བྱ་བ་འམ། བདེ་ཞེས་བྱ་བ་འམ། སྡུག་བསྔལ་ཞེས་བྱ་བ་འམ། བདག་ཡོད་ཅེས་བྱ་བ་འམ་བདག་མེད་ཅེས་བྱ་བ་འམ།
en: They are not fixated on the notions that [the goals], up to and including all-aspect omniscience, are void or not void. “

source: ཞི་ཞེས་བྱ་བ་འམ་མ་ཞི་ཞེས་བྱ་བ་འམ། སྟོང་ཞེས་བྱ་བ་འམ་མི་སྟོང་ཞེས་བྱ་བ་འམ། མཚན་མ་ཡོད་ཅེས་བྱ་བ་འམ། མཚན་མ་མེད་ཅེས་བྱ་བ་འམ། སྨོན་པ་ཡོད་ཅེས་བྱ་བ་འམ།
en: If you ask why, one cannot attain consummate buddhahood with respect to phenomena without inherent existence, which are said to be permanent or impermanent, which are said to be imbued with happiness or imbued with suffering, which are said to be with self or without self, which are said to be at peace or not at peace, which are said to be empty or not empty, which are said to be with signs or without signs, which are said to have aspirations or lack aspirations, and which are said to be void or not void.

source: སྨོན་པ་མེད་ཅེས་བྱ་བ་འམ། དབེན་ཞེས་བྱ་བ་འམ་མི་དབེན་ཞེས་བྱ་བར་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ། །ངོ་བོ་ཉིད་ནི་ངོ་བོ་ཉིད་ཀྱིས་མངོན་པར་བསྒྲུབ་པར་མི་ནུས་ཏེ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་།
en: The essential nature cannot be brought into being by means of the essential nature. “

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གནས་པར་འགྱུར་རོ།
en: Subhūti, those bodhisattva great beings who practice the perfection of wisdom, the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity will dwell in all-aspect omniscience.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ལྡན་པ་ནི། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེར་འགྲོའོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་པོ་འདི་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྗེས་སུ་འབྲང་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ན་བ་དེར་གནས་པར་འགྱུར་རོ།
en: Subhūti, just as the army of an imperial monarch with its four corps goes wherever that imperial monarch goes, in the same way, Subhūti, those other five perfections indeed follow the perfection of wisdom, and they come to a halt wherever all-aspect omniscience is.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ཁ་ལོ་སྒྱུར་བ་ནི་རྟ་ཟུང་བཞི་པའི་ཤིང་རྟ་ལ་ཞོན་ཞིང་ལམ་མཉམ་པ་ནས་འགྲོའོ། །དེ་བཞིན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔའི་ཁ་ལོ་སྒྱུར་བ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གང་ན་བ་དེར་ལམ་མཉམ་པ་ནས་འགྲོའོ།
en: Subhūti, just as an imperial monarch traverses a straight path, riding a chariot drawn by four pairs of horses, in the same way the perfection of wisdom, driving the other five perfections, indeed traverses the smooth path that leads to all-aspect omniscience.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལམ་ནི་གང་ལགས།
en: Blessed Lord, what is the path of bodhisattva great beings?

source: ལམ་མ་ལགས་པ་ནི་གང་ལགས།
en: What is not their path?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱ་བ་ལ་ཉན་ཐོས་ཀྱི་ལམ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལམ་མ་ཡིན་ནོ། །རང་སངས་རྒྱས་ཀྱི་ལམ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལམ་མ་ཡིན་ནོ།
en: The Blessed One replied, “For those who would attain all-aspect omniscience, the path of the śrāvakas is not the path of bodhisattva great beings, and the path of the pratyekabuddhas is not the path of bodhisattva great beings.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱ་བ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྔོན་དུ་འགྲོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལམ་སྟེ།
en: For those who would attain all-aspect omniscience, the six perfections with the perfection of wisdom in front are the path of bodhisattva great beings.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལམ་དང་ལམ་མ་ཡིན་པའོ། །གསོལ་པ།
en: These respectively are not and are the paths of bodhisattva great beings.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལམ་དང་ལམ་མ་ལགས་པ་སྟོན་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་དོན་ཆེན་པོའི་སླད་དུ་ཉེ་བར་གནས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, so it is that this perfection of wisdom, disclosing what is and is not the path, is established for the great advantage of bodhisattva great beings.” “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ལམ་དང་ལམ་མ་ཡིན་པ་སྟོན་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་དོན་ཆེན་པོའི་ཕྱིར་ཉེ་བར་གནས་སོ།
en: By disclosing what is and is not the path, the perfection of wisdom is established for the great advantage of bodhisattva great beings. {

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་དོན་ཚད་མེད་པའི་ཕྱིར་ཉེ་བར་གནས་སོ།
en: Ki.V: 62} The perfection of wisdom is established for the immeasurable advantages of bodhisattva great beings.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་དོན་གྲངས་མེད་པའི་ཕྱིར་ཉེ་བར་གནས་ཏེ།
en: The perfection of wisdom is established for the countless advantages of bodhisattva great beings.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དོན་དེ་ཡང་བརྗོད་མོད་ཀྱི། གཟུགས་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: Yet despite expressing these advantages, the perfection of wisdom does not appropriate physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མི་འཛིན་ཏོ།
en: It does not appropriate feelings, perceptions, formative predispositions, or consciousness.

source: །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་འགྱུར་བའི་བར་དུ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ།
en: It is not established in order to appropriate [the goals], up to and including those on the levels of the śrāvakas or pratyekabuddhas.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་འཐོབ་པར་བྱེད་པ་མ་ཡིན་ནོ།
en: This perfection of wisdom does not bring bodhisattva great beings to acquire unsurpassed, complete enlightenment.

source: །ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་འདོར་བ་མ་ཡིན་ནོ།
en: It does not reject the level of the śrāvakas or the level of the pratyekabuddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་སྤྲོད་པ་མ་ཡིན་ནོ།
en: It does not confer all-aspect omniscience.

source: །དེ་ལྟར་ཆོས་ཀྱི་གནས་ཉིད་ཚད་མར་བྱས་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆོས་གང་ཡང་སྐྱེད་པ་མ་ཡིན། འགོག་པ་མ་ཡིན་ནོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཆོས་གང་ཡང་བསྐྱེད་པ་མ་ལགས།
en: Taking the abiding nature of reality as the standard, this perfection of wisdom does not produce or stop anything at all.” “

source: འགོག་པ་མ་ལགས་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས། ཇི་ལྟར་སྦྱིན་པ་ཡོངས་སུ་གཏང་བར་བགྱི། ཇི་ལྟར་ཚུལ་ཁྲིམས་བསྲུང་བར་བགྱི། ཇི་ལྟར་བཟོད་པ་བསྒོམ་པར་བགྱི། ཇི་ལྟར་བརྩོན་འགྲུས་བརྩམ་པར་བགྱི།
en: Blessed Lord, if this perfection of wisdom does not produce or stop anything at all, in that case, Blessed Lord, how should bodhisattva great beings who practice the perfection of wisdom dispense gifts, how should they maintain ethical discipline, how should they cultivate tolerance, how should they undertake perseverance, how should they be absorbed in meditative concentration, and how should they cultivate wisdom?” “

source: ཇི་ལྟར་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པར་བགྱི། ཇི་ལྟར་ཤེས་རབ་ལ་བསྒོམ་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་ཏེ། སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: Subhūti,” replied the Blessed One, “they should dispense gifts while referring to all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་ཏེ། ཚུལ་ཁྲིམས་བསྲུང་བར་བྱའོ།
en: They should maintain ethical discipline while referring to all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་ཏེ། བཟོད་པ་བསྒོམ་པར་བྱའོ།
en: They should cultivate tolerance while referring to all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་ཏེ། བརྩོན་འགྲུས་བརྩམ་པར་བྱའོ།
en: They should undertake perseverance while referring to all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་ཏེ། བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པར་བྱའོ།
en: They should be absorbed in meditative concentration while referring to all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་ཏེ། ཤེས་རབ་བསྒོམ་པར་བྱའོ།
en: They should cultivate wisdom while referring to all-aspect omniscience.

source: །དེས་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: Making common cause with all beings, they should dedicate those roots of virtuous action to unsurpassed, complete enlightenment.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: If bodhisattva great beings dedicate their roots of virtuous action to unsurpassed, complete enlightenment, they will complete the cultivation of the six perfections.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་བསྒོམ་པ་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: Bodhisattva great beings who cultivate loving kindness [will complete the cultivation of] all-aspect omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་མ་བྲལ་བ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མ་བྲལ་བ་སྟེ།
en: Bodhisattva great beings who are not without the six perfections are not without all-aspect omniscience.

source: དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Therefore, bodhisattva great beings who wish to attain consummate buddhahood in unsurpassed, complete enlightenment should practice the six perfections.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Bodhisattva great beings who practice the six perfections will complete all the roots of virtuous action and then attain all-aspect omniscience.

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་པར་བྱའོ།
en: So it is, Subhūti, {Ki.V: 63} that bodhisattva great beings should persevere in the six perfections.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how should bodhisattva great beings persevere in the six perfections?” “
